//
// texanim.c
//
// texture animation code lives here
//

#include "logging.h"
#include "texanim.h"
#include "misc.h"

#include <n64.h>
#include <stdio.h>

#define GRAPH_ALLOC n64_graph_alloc
#define Gfx GbiGfx
#define OPEN_DISPS() do{}while(0)
#define CLOSE_DISPS() do{}while(0)
#define Lib_SegmentedToVirtual(X) X // segmented addresses are resolved on load, so this isn't necessary

#undef ABS
#define ABS(x) ((x) >= 0 ? (x) : -(x))
#define ABS_ALT(x) ((x) < 0 ? -(x) : (x))

//! checks min first
#define CLAMP(x, min, max) ((x) < (min) ? (min) : (x) > (max) ? (max) : (x))
//! checks max first
#define CLAMP_ALT(x, min, max) ((x) > (max) ? (max) : (x) < (min) ? (min) : (x))
#define CLAMP_MAX(x, max) ((x) > (max) ? (max) : (x))
#define CLAMP_MIN(x, min) ((x) < (min) ? (min) : (x))

static texAnimStep_t sGameplayFrames;

static uint32_t Swap32(const uint32_t b)
{
	uint32_t result = 0;
	
	result |= ((b >> 24) & 0xff) <<  0;
	result |= ((b >> 16) & 0xff) <<  8;
	result |= ((b >>  8) & 0xff) << 16;
	result |= ((b >>  0) & 0xff) << 24;
	
	return result;
}

#if 1 // region: private types

typedef struct {
	/* 0x0 */ uint16_t durationFrames;
	/* 0x2 */ uint16_t keyFrameCount;
	/* 0x4 */ uint32_t primColors;
	/* 0x8 */ uint32_t envColors;
	/* 0xC */ uint32_t keyFrames;
} AnimatedMatColorParams64; // size = 0x10

typedef struct {
	/* 0x0 */ int8_t xStep;
	/* 0x1 */ int8_t yStep;
	/* 0x2 */ uint8_t width;
	/* 0x3 */ uint8_t height;
} AnimatedMatTexScrollParams64; // size = 0x4

typedef struct {
	/* 0x0 */ uint16_t durationFrames;
	/* 0x4 */ uint32_t textureList; // segmet addresses
	/* 0x8 */ uint32_t textureIndexList;
} AnimatedMatTexCycleParams64; // size = 0xC

typedef struct {
	/* 0x0 */ int8_t segment;
	/* 0x2 */ int16_t type;
	/* 0x4 */ uint32_t params;
} AnimatedMaterial64; // size = 0x8

#endif // endregion

#if 1 // region: mm, animatedmat, private

static texAnimStep_t sMatAnimStep;
static uint32_t sMatAnimFlags;
static float sMatAnimAlphaRatio;
static AnimatedMaterial *sSceneMaterialAnims;

static void *InterpretTexturePtrAddress(TexturePtr tex)
{
	if (tex.addr)
		return n64_segment_get(tex.addr);
	
	// TODO avoids an #include for datablobs.h, but is cursed (refactor later)
	if (tex.datablob)
		return *((void**)tex.datablob);
	
	return 0;
}

static SceneAnimFlag SceneAnimFlagFromBytes(const void *bytes)
{
	const uint8_t *b = bytes;
	
	return (SceneAnimFlag) {
		.flag = u32r(b + 0),
		.bits = u32r(b + 4),
		.type = u8r(b + 8),
		.eq = u8r(b + 9),
		.xfade = u16r(b + 10),
		.isAvailable = true,
		.isEnabled = true,
		.isPreviewing = true,
	};
}

/**
 * Returns a pointer to a single layer texture scroll displaylist.
 */
static Gfx* AnimatedMat_TexScroll(AnimatedMatTexScrollParams* params) {
